TrelloN/app/views/cards/show.html.slim

SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1  [["card_id", 1]]
---
ul.tasks-list
  - @card.tasks.each do |task|