TrelloN/app/views/cards/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = $1  [["card_id", 3]]
---
<ul>
  <%- @card.tasks.each do |task|%>