TrelloN/app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT "cards".* FROM "cards" WHERE "cards"."created_at" = $1  [["created_at", "2020-11-11"]]

  def show
    @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def edit
    @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @card = Card.new(card_params)
    if @card.save
---
INSERT INTO "cards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Today"], ["created_at", "2020-11-12 15:01:38.064560"], ["updated_at", "2020-11-12 15:01:38.064560"]]

  def update
    @card = Card.find(params[:id])

    if @card.update(card_params)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cards" SET "title" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["title", "Testq"], ["updated_at", "2020-11-08 17:18:35.644136"], ["id", 1]]

  def destroy
    @card = Card.find(params[:id])
    @card.destroy
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 7]]