TrelloN/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (created_at > '2020-10-16')
---
  def index
    @tasks = Task.all